
df <- read.csv("E:\\Andrei\\Pet_project_home_office\\ride_data.csv", 
               stringsAsFactors = TRUE) 

str(df) 

names(df)[names(df) == "ride.type"] <- "ride_type"

# Type casting

df$start_hour <- as.numeric(format(df$start_time, "%H"))


# Построение линейной модели 

# Модель пытается предсказать переменную duration с учетом

# ride_type (тип транспорта: метро или троллейбус)
# departure_arrive (направление: отправление или прибытие)

model_mt <- lm(duration ~ ride_type + departure_arrive, data = df)
summary(model_mt) 

# R-squared:  0.6011

# Интерпретация 

# Intercept

# Prediction 
# Estimate: 53.5189

# Это значение — ожидаемое среднее время поездки, если все факторы 
# равны нулю (то есть, если тип транспорта trolleybus, 
# направление — departure и время начала — 00:00)

# p-value: 0.000171, значение Intercept значимое 

# ride_type 

# Estimate: 8.9142 

# Это означает, что поездка на троллейбусе в среднем на 8.91 минут 
# дольше, чем на метро (если все другие переменные равны нулю)

# p-value ~ 0, тогда коэффициент значимый 

# другие коэффициенты являются незначимыми 

df$predicted <- predict(model, newdata = df) 

df 

# Значимые результаты 

# 1. Время поездки зависит от типа транспорта (троллейбус или метро)

# Время поездки на троллейбусе в среднем на 8.91 минут больше, 
# чем на метро, при прочих равных 

# 2. Направление поездки и время начала не имеют значительного 
# влияния на продолжительность поездки в этой модели

# Предсказание для trolleybus при arrival далеки от реальных 
# значений, так как имеются outliers и мы не учитываем некоторые
# другие факторы, которые могли повлиять (сезонность, день недели,
# наличие или отсутствие пробок и др.) 
# Также можно увеличить выборку для более надежных результатов


